FKDD_COPY_DIFF_3_2026-02-13/Reports/СостояниеЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СостояниеЗаказовПокупателей</Name>
			<Comment>Состояние заказов покупателей</Comment>
		</Properties>
	</Report>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<Comment>Заказы покупателей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Comment>Количество номенклатуры по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество номенклатуры, зарезервированной на складе для этого заказа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервСвободный</Name>
					<Comment>Количество номенклатуры, зарезервированной на складе для этого заказа из свободного остатка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма заказанной номенклатуры в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма заказанной номенклатуры в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции с заказом(заказ, резервирование...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗамены</Name>
					<Comment>Идентификатор операции замены заказанного товара на другой</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, разместивший заказ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Comment>Документ оформления заказа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании на котором был зарезервирован товар для этого заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Reports/СостояниеЗаказовПокупателей/Ext/ObjectModule.bsl
Функция ПолучитьСвойства() Экспорт
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("Контрагент");
	СтруктураСвойств.Вставить("Заказ");
	СтруктураСвойств.Вставить("Номенклатура");
	СтруктураСвойств.Вставить("Регистратор");
	
	Возврат СтруктураСвойств;
	
КонецФункции

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

//Устанавливает параметр построителя отчета "СписокЗаказов"
//
//Без параметров
//
Процедура УстановитьПараметры() Экспорт
	
	//РежимВывода
	//Выводить все
	//Не выводить закрытые заказы
	//Выводить заказы поступившие но не отгруженные
	
	Запрос = Новый Запрос;
	
	ПоляОграничения = Новый Массив;
	ПоляОграничения.Добавить("Контрагент");
	ПоляОграничения.Добавить("Заказ");
	ПоляОграничения.Добавить("Номенклатура");
	ПоляОграничения.Добавить("ХарактеристикаНоменклатуры");
	
	ОтборКомпоновки = КомпоновщикНастроек.Настройки.Отбор;
	
	ТекстОтбора = ОтчетыСервер.КомпоновщикПолучитьТекстОтбора(ОтборКомпоновки.Элементы, ОтборКомпоновки.ДоступныеПоляОтбора, "ЗаказыПокупателей", Запрос.Параметры,, ПоляОграничения);
	ТекстОтбора = ?(ТекстОтбора = "", "", " И " + Символы.ПС + ТекстОтбора);
	
	ДатаНач = ОтчетыСервер.КомпоновщикПолучитьЗначениеПараметра("ДатаНачала",    КомпоновщикНастроек.Настройки);
	ДатаКон = ОтчетыСервер.КомпоновщикПолучитьЗначениеПараметра("ДатаОкончания", КомпоновщикНастроек.Настройки);
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	
	РежимВывода = ОтчетыСервер.КомпоновщикПолучитьЗначениеПараметра("РежимВывода", КомпоновщикНастроек.Настройки);
	
	Если РежимВывода = 0 Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказыПокупателей.Заказ КАК Заказ
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
		|ГДЕ
		|	ЗаказыПокупателей.Период МЕЖДУ &ДатаНач И &ДатаКон" + ТекстОтбора +"
		|";
	ИначеЕсли РежимВывода = 3 Тогда
		
		ТекстПараметров = ОтчетыСервер.КомпоновщикПолучитьТекстОтбора(ОтборКомпоновки.Элементы, ОтборКомпоновки.ДоступныеПоляОтбора, "", Запрос.Параметры,, ПоляОграничения);
		ТекстПараметров = ?(ТекстПараметров = "", "", " И " + Символы.ПС + ТекстПараметров);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказыПокупателей.Заказ КАК Заказ
		|ПОМЕСТИТЬ
		|	ТаблицаЗаказов
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
		|ГДЕ
		|	ЗаказыПокупателей.Период МЕЖДУ &ДатаНач И &ДатаКон" + ТекстОтбора +"
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ
		|;
		|
		|ВЫБРАТЬ
		|	ВложенныЙЗапрос.Заказ КАК Заказ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказыПокупателейОстатки.Заказ КАК Заказ,
		|		ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
		|		ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|		ВЫБОР
		|			КОГДА ЗаказыПокупателейОстатки.ЗаказаноОстаток = ЗаказыПокупателейОстатки.РезервОстаток ТОГДА
		|				1
		|			ИНАЧЕ
		|				0
		|		КОНЕЦ КАК СовпадаетЗаказИРезерв
		|	ИЗ
		|		РегистрНакопления.ЗаказыПокупателей.Остатки(&ДатаКонГраница,
		|		Заказ В (ВЫБРАТЬ Заказ ИЗ ТаблицаЗаказов)" + ТекстПараметров + ") КАК ЗаказыПокупателейОстатки
		|	ГДЕ
		|		ЗаказыПокупателейОстатки.ЗаказаноОстаток>0) КАК ВложенныЙЗапрос
		|СГРУППИРОВАТЬ ПО
		|	ВложенныЙЗапрос.Заказ
		|ИМЕЮЩИЕ
		|	МИНИМУМ(ВложенныЙЗапрос.СовпадаетЗаказИРезерв)>0
		|";
		
		ДатаКон = ОтчетыСервер.КомпоновщикПолучитьЗначениеПараметра("ДатаОкончанияГраница", КомпоновщикНастроек.Настройки);
		Запрос.УстановитьПараметр("ДатаКонГраница", ДатаКон);
		
	Иначе
		
		Если РежимВывода = 1 Тогда
			СтрокаОтбора = "(НЕ ЗаказыПокупателейОстатки.ЗаказаноОстаток = 0)";
		Иначе
			СтрокаОтбора = "(НЕ ЗаказыПокупателейОстатки.РезервОстаток = 0)";
		КонецЕсли;
		
		ТекстПараметров = ОтчетыСервер.КомпоновщикПолучитьТекстОтбора(ОтборКомпоновки.Элементы, ОтборКомпоновки.ДоступныеПоляОтбора, "", Запрос.Параметры,, ПоляОграничения);
		ТекстПараметров = ?(ТекстПараметров = "", "", " И " + Символы.ПС + ТекстПараметров);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказыПокупателей.Заказ КАК Заказ
		|ПОМЕСТИТЬ
		|	ТаблицаЗаказов
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
		|ГДЕ
		|	ЗаказыПокупателей.Период МЕЖДУ &ДатаНач И &ДатаКон" + ТекстОтбора +"
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ
		|;
		|
		|ВЫБРАТЬ
		|	ЗаказыПокупателейОстатки.Заказ КАК Заказ
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Остатки(&ДатаКонГраница,
		|	Заказ В (ВЫБРАТЬ Заказ ИЗ ТаблицаЗаказов)" + ТекстПараметров + ") КАК ЗаказыПокупателейОстатки
		|ГДЕ
		|	"+СтрокаОтбора+"
		|";
		
		ДатаКон = ОтчетыСервер.КомпоновщикПолучитьЗначениеПараметра("ДатаОкончанияГраница", КомпоновщикНастроек.Настройки);
		Запрос.УстановитьПараметр("ДатаКонГраница", ДатаКон);
		
	КонецЕсли;
	
	СписокЗаказов = Новый СписокЗначений;
	СписокЗаказов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ"));
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокЗаказов", СписокЗаказов);
	
КонецПроцедуры // УстановитьПараметры()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	УстановитьПараметры();
	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

//ПоследовательностиОтчета = Новый ТаблицаЗначений();
//ПоследовательностиОтчета.Колонки.Добавить("ИмяГраницы");
//ПоследовательностиОтчета.Колонки.Добавить("Представление");
//ПоследовательностиОтчета.Колонки.Добавить("РегистрыНакопления");
//ПоследовательностиОтчета.Колонки.Добавить("Измерения");

//НоваяСтрока = ПоследовательностиОтчета.Добавить();
//НоваяСтрока.ИмяГраницы = "ГраницыЗаказы";
//НоваяСтрока.Представление = "Заказы";
//СтруктураРегистровНакопления = Новый Структура();
//СтруктураРегистровНакопления.Вставить("ЗаказыПокупателей",Новый Структура("Заказ","Заказ"));
//СтруктураРегистровНакопления.Вставить("ЗаказыРаспределение",Новый Структура("Заказ","ЗаказПокупателя"));
//НоваяСтрока.РегистрыНакопления = СтруктураРегистровНакопления;
//МассивИзмерений = Новый Массив(); МассивИзмерений.Добавить("Заказ");
//НоваяСтрока.Измерения = МассивИзмерений;
